app/controllers/v1/exercises_controller.rb

    def index
      @exercises = Exercise.with_attached_image.all
---
SELECT `exercises`.* FROM `exercises`

    def set_exercise
      @exercise = Exercise.find_by(id: params[:id])
---
SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 1 LIMIT 1